<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<!--

    DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

    Copyright (c) 2008-2010 Oracle and/or its affiliates. All rights reserved.

    The contents of this file are subject to the terms of either the GNU
    General Public License Version 2 only ("GPL") or the Common Development
    and Distribution License("CDDL") (collectively, the "License").  You
    may not use this file except in compliance with the License.  You can
    obtain a copy of the License at
    https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
    or packager/legal/LICENSE.txt.  See the License for the specific
    language governing permissions and limitations under the License.

    When distributing the software, include this License Header Notice in each
    file and include the License file at glassfish/bootstrap/legal/LICENSE.txt.

    GPL Classpath Exception:
    Oracle designates this particular file as subject to the "Classpath"
    exception as provided by Oracle in the GPL Version 2 section of the License
    file that accompanied this code.

    Modifications:
    If applicable, add the following below the License Header, with the fields
    enclosed by brackets [] replaced by your own identifying information:
    "Portions Copyright [year] [name of copyright owner]"

    Contributor(s):
    If you wish your version of this file to be governed by only the CDDL or
    only the GPL Version 2, indicate your decision by adding "[Contributor]
    elects to include this software in this distribution under the [CDDL or GPL
    Version 2] license."  If you don't indicate a single choice of license, a
    recipient has the option to distribute your version of this file under
    either the CDDL, the GPL Version 2 or to extend the choice of license to
    its licensees as provided above.  However, if you add GPL Version 2 code
    and therefore, elected the GPL Version 2 license, then the option applies
    only if the new code is made subject to such option by the copyright
    holder.

-->

<html>
<head>
<meta http-equiv="Content-type" content="text/html; charset=UTF-8">
<title>Para criar uma nova imagem instalada - Ajuda on-line da Update Tool</title>
<meta name="robots" content="index,follow">
<meta name="robots" content="index,follow">
<meta name="date" content="">
</head>

<body>



<a name="tasks-creating-image"></a><h4>Para criar uma nova imagem instalada</h4>
<p>Quando &eacute; necess&aacute;rio criar uma nova imagem vazia de instala&ccedil;&atilde;o e associ&aacute;-la a um ou mais reposit&oacute;rios de componentes, use o recurso Nova imagem da interface gr&aacute;fica do usu&aacute;rio da Update Tool. Ap&oacute;s criar a imagem vazia de instala&ccedil;&atilde;o, voc&ecirc; pode selecionar componentes de suplementos nos reposit&oacute;rios e instal&aacute;-los na nova imagem.</p>
<p>
    <ol><li><p>Na barra de ferramentas, clique em Novo.</p><p>A Update Tool exibe a janela Criar nova imagem de instala&ccedil;&atilde;o.</p><p></p></li>
<li><p>Na caixa T&iacute;tulo da imagem, digite um nome para a imagem de instala&ccedil;&atilde;o.</p><p>Esse nome aparecer&aacute; no painel Imagens de aplicativos como o nome da imagem instalada; portanto, use um t&iacute;tulo relativamente breve.</p><p></p></li>
<li><p>Na caixa Diret&oacute;rio de imagem, digite o caminho completo do diret&oacute;rio que armazenar&aacute; a imagem.</p><p>Como alternativa, clique no bot&atilde;o ... e navegue at&eacute; (e crie opcionalmente) o diret&oacute;rio..</p><p>Todos os componentes de suplementos ser&atilde;o instalados nesse local.</p><p></p></li>
<li><p>Na caixa Descri&ccedil;&atilde;o da imagem, digite uma descri&ccedil;&atilde;o opcional da imagem.</p></li>
<li><p>Na se&ccedil;&atilde;o Reposit&oacute;rios, use o bot&atilde;o Adicionar... para acrescentar um ou mais reposit&oacute;rios para a imagem.</p><p>Para cada reposit&oacute;rio adicionado, forne&ccedil;a o nome de um editor e especifique o URL do editor do reposit&oacute;rio.</p><p>O nome do editor aparecer&aacute; na coluna &quot;Origem&quot;, quando voc&ecirc; exibir listas de componentes de suplementos e atualiza&ccedil;&otilde;es dispon&iacute;veis.</p><p></p></li>
<li><p>Clique em OK.</p><p>A Update Tool adiciona a imagem &agrave; lista do painel Imagens de aplicativos, entra em contato com os reposit&oacute;rios, coleta a lista de componentes que podem ser instalados e exibe a lista em Suplementos dispon&iacute;veis..</p></li></ol>
</p>

<p>Voc&ecirc; pode adicionar v&aacute;rios reposit&oacute;rios de editor &agrave; imagem de instala&ccedil;&atilde;o, mas um deles deve ser marcado como editor preferencial. Suplementos do editor preferencial t&ecirc;m preced&ecirc;ncia sobre suplementos de mesmo nome disponibilizados por outros editores associados &agrave; imagem de instala&ccedil;&atilde;o.</p>

<p>Consulte a se&ccedil;&atilde;o <a href="repositories.html">Reposit&oacute;rios e editores</a>, para obter mais informa&ccedil;&otilde;es sobre o editor preferencial e seu impacto na instala&ccedil;&atilde;o e atualiza&ccedil;&atilde;o de componentes.</p>

<p>Agora, voc&ecirc; est&aacute; pronto para <a href="tasks-installing-add-ons.html">procurar e instalar componentes de suplementos</a> associados &agrave; nova imagem.</p>



</body>
</html>

