<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<!--

    DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

    Copyright (c) 2008-2010 Oracle and/or its affiliates. All rights reserved.

    The contents of this file are subject to the terms of either the GNU
    General Public License Version 2 only ("GPL") or the Common Development
    and Distribution License("CDDL") (collectively, the "License").  You
    may not use this file except in compliance with the License.  You can
    obtain a copy of the License at
    https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
    or packager/legal/LICENSE.txt.  See the License for the specific
    language governing permissions and limitations under the License.

    When distributing the software, include this License Header Notice in each
    file and include the License file at glassfish/bootstrap/legal/LICENSE.txt.

    GPL Classpath Exception:
    Oracle designates this particular file as subject to the "Classpath"
    exception as provided by Oracle in the GPL Version 2 section of the License
    file that accompanied this code.

    Modifications:
    If applicable, add the following below the License Header, with the fields
    enclosed by brackets [] replaced by your own identifying information:
    "Portions Copyright [year] [name of copyright owner]"

    Contributor(s):
    If you wish your version of this file to be governed by only the CDDL or
    only the GPL Version 2, indicate your decision by adding "[Contributor]
    elects to include this software in this distribution under the [CDDL or GPL
    Version 2] license."  If you don't indicate a single choice of license, a
    recipient has the option to distribute your version of this file under
    either the CDDL, the GPL Version 2 or to extend the choice of license to
    its licensees as provided above.  However, if you add GPL Version 2 code
    and therefore, elected the GPL Version 2 license, then the option applies
    only if the new code is made subject to such option by the copyright
    holder.

-->

<html>
<head>
<meta http-equiv="Content-type" content="text/html; charset=UTF-8">
<title>Informations document - Aide en ligne de l'outil de mise &agrave; jour</title>
<meta name="robots" content="index,follow">
<meta name="robots" content="index,follow">
<meta name="date" content="">
</head>

<body>



<a name="documentinfo"></a><p>N&deg; de composante : 820-5844</p><p></p><p>4150 Network Circle<br>Santa Clara, CA 95054<br>&Eacute;tats-Unis</p><p>Copyright 2008 Sun Microsystems, Inc.</p><p>Sun Microsystems, Inc. d&eacute;tient les droits de propri&eacute;t&eacute; intellectuelle relatifs &agrave; la technologie incorpor&eacute;e dans le produit qui est d&eacute;crit dans ce document. En particulier, et ce sans limitation, ces droits de propri&eacute;t&eacute; intellectuelle peuvent inclure un ou plusieurs brevets am&eacute;ricains ou des applications de brevet en attente aux &Eacute;tats-Unis et dans d'autres pays.</p><p>Droits du Gouvernement des &Eacute;tats-Unis - Logiciel Commercial. Les utilisateurs fonctionnaires sont soumis au contrat de licence standard de Sun Microsystems, Inc. et aux dispositions applicables du FAR et de ses suppl&eacute;ments.</p><p>Cette distribution peut comprendre des composants d&eacute;velopp&eacute;s par des tierces personnes.</p><p>Certaines composants de ce produit peuvent &ecirc;tre d&eacute;riv&eacute;es du logiciel Berkeley BSD, licenci&eacute; par l'Universit&eacute; de Californie. UNIX est une marque d&eacute;pos&eacute;e aux &Eacute;tats-Unis et dans d'autres pays; elle est licenci&eacute;e exclusivement par X/Open Company, Ltd. </p><p>Sun, Sun Microsystems, le logo Sun, le logo Solaris, le logo Java Coffee Cup, docs.sun.com, Java et Solaris sont des marques de fabrique ou des marques d&eacute;pos&eacute;es de Sun Microsystems, Inc. aux &Eacute;tats-Unis et dans d'autres pays Toutes les marques SPARC sont utilis&eacute;es sous licence et sont des marques de fabrique ou des marques d&eacute;pos&eacute;es de SPARC International, Inc. aux &Eacute;tats-Unis et dans d'autres pays. Les produits portant les marques SPARC sont bas&eacute;s sur une architecture d&eacute;velopp&eacute;e par Sun Microsystems, Inc. 
</p><p>L'interface d'utilisation graphique OPEN LOOK et Sun<sup>TM</sup> a &eacute;t&eacute; d&eacute;velopp&eacute;e par Sun Microsystems, Inc. pour ses utilisateurs et licenci&eacute;s. Sun reconna&icirc;t les efforts de pionniers de Xerox pour la recherche et le d&eacute;veloppement du concept des interfaces d'utilisation visuelle ou graphique pour l'industrie de l'informatique. Sun d&eacute;tient une licence non exclusive de Xerox sur l'interface d'utilisation graphique Xerox, cette licence couvrant &eacute;galement les licenci&eacute;s de Sun qui mettent en place l'interface d'utilisation graphique OPEN LOOK et qui, en outre, se conforment aux licences &eacute;crites de Sun.</p><p> Les produits qui font l'objet de cette publication et les informations qu'il contient sont r&eacute;gis par la legislation am&eacute;ricaine en mati&egrave;re de contr&ocirc;le des exportations et peuvent &ecirc;tre soumis au droit d'autres pays dans le domaine des exportations et importations. Les utilisations finales, ou utilisateurs finaux, pour des armes nucl&eacute;aires, des missiles, des armes chimiques ou biologiques ou pour le nucl&eacute;aire maritime, directement ou indirectement, sont strictement interdites. Les exportations ou r&eacute;exportations vers des pays sous embargo des &Eacute;tats-Unis, ou vers des entit&eacute;s figurant sur les listes d'exclusion d'exportation am&eacute;ricaines, y compris, mais de mani&egrave;re non exclusive, la liste de personnes qui font objet d'un ordre de ne pas participer, d'une fa&ccedil;on directe ou indirecte, aux exportations des produits ou des services qui sont r&eacute;gis par la l&eacute;gislation am&eacute;ricaine en mati&egrave;re de contr&ocirc;le des exportations et la liste de ressortissants sp&eacute;cifiquement d&eacute;sign&eacute;s, sont rigoureusement interdites.</p><p>LA DOCUMENTATION EST FOURNIE &quot;EN L'&Eacute;TAT&quot; ET TOUTES AUTRES CONDITIONS, D&Eacute;CLARATIONS ET GARANTIES EXPRESSES OU TACITES SONT FORMELLEMENT EXCLUES, DANS LA MESURE AUTORIS&Eacute;E PAR LA LOI APPLICABLE, Y COMPRIS NOTAMMENT TOUTE GARANTIE IMPLICITE RELATIVE &Agrave; LA QUALIT&Eacute; MARCHANDE, &Agrave; L'APTITUDE &Agrave; UNE UTILISATION PARTICULI&Egrave;RE OU &Agrave; L'ABSENCE DE CONTREFA&Ccedil;ON.</p>




</body>
</html>

