<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<!--

    DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

    Copyright (c) 2008-2010 Oracle and/or its affiliates. All rights reserved.

    The contents of this file are subject to the terms of either the GNU
    General Public License Version 2 only ("GPL") or the Common Development
    and Distribution License("CDDL") (collectively, the "License").  You
    may not use this file except in compliance with the License.  You can
    obtain a copy of the License at
    https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
    or packager/legal/LICENSE.txt.  See the License for the specific
    language governing permissions and limitations under the License.

    When distributing the software, include this License Header Notice in each
    file and include the License file at glassfish/bootstrap/legal/LICENSE.txt.

    GPL Classpath Exception:
    Oracle designates this particular file as subject to the "Classpath"
    exception as provided by Oracle in the GPL Version 2 section of the License
    file that accompanied this code.

    Modifications:
    If applicable, add the following below the License Header, with the fields
    enclosed by brackets [] replaced by your own identifying information:
    "Portions Copyright [year] [name of copyright owner]"

    Contributor(s):
    If you wish your version of this file to be governed by only the CDDL or
    only the GPL Version 2, indicate your decision by adding "[Contributor]
    elects to include this software in this distribution under the [CDDL or GPL
    Version 2] license."  If you don't indicate a single choice of license, a
    recipient has the option to distribute your version of this file under
    either the CDDL, the GPL Version 2 or to extend the choice of license to
    its licensees as provided above.  However, if you add GPL Version 2 code
    and therefore, elected the GPL Version 2 license, then the option applies
    only if the new code is made subject to such option by the copyright
    holder.

-->

<html>
<head>
<meta http-equiv="Content-type" content="text/html; charset=UTF-8">
<title>Avertisseur du bureau - Aide en ligne de l'outil de mise &agrave; jour</title>
<meta name="robots" content="index,follow">
<meta name="robots" content="index,follow">
<meta name="date" content="">
</head>

<body>
<a name="notifier"></a><h4>Avertisseur du bureau</h4>
<p>Une t&acirc;che d'avertissement (ou avertisseur) du bureau coop&egrave;re avec l'outil de mise &agrave; jour pour v&eacute;rifier p&eacute;riodiquement les mises &agrave; jour et vous en avertir, via votre bureau, pour toutes les images d'installation connues lors de votre installation de l'outil de mise &agrave; jour.</p>

<p><b>Enregistrement de l'avertisseur</b></p>
<p>Si vous choisissez de v&eacute;rifier automatiquement les mises &agrave; jour et d'en &ecirc;tre averti durant l'installation initiale de votre image, l'avertisseur sera automatiquement enregistr&eacute; comme programme de d&eacute;marrage dans votre environnement de bureau.</p>

<p>Si un programme d'installation initial n'enregistre pas l'avertisseur, vous pouvez faire en sorte que celui-ci soit enregistr&eacute; automatiquement en ex&eacute;cutant simplement l'outil de mise &agrave; jour durant au moins une minute. Tant que les pr&eacute;f&eacute;rences de votre outil de mise &agrave; jour sp&eacute;cifient une fr&eacute;quence de mise &agrave; jour autre que &quot;Jamais&quot;, l'avertisseur sera enregistr&eacute; automatiquement.</p>

<p><b>D&eacute;marrage de l'avertisseur</b></p>
<p>Chaque fois que vous vous connectez &agrave; votre bureau, l'avertisseur d&eacute;marre et s'ex&eacute;cute comme un processus en arri&egrave;re-plan. L'avertisseur ne s'affiche dans la zone de notification de votre bureau que s'il existe des mises &agrave; jour disponibles pour une ou plusieurs de vos images d'installation. (L'exception concerne Mac OS X pour lequel l'avertisseur n'est jamais repr&eacute;sent&eacute; dans la station d'accueil de votre ordinateur).</p>

<p><b>Notification des mises &agrave; jours</b></p>
<p>Lorsque l'avertisseur d&eacute;tecte des mises &agrave; jour disponibles, il affiche une ic&ocirc;ne dans la zone de notification de votre bureau et ouvre une fen&ecirc;tre vous permettant de lancer l'outil de mise &agrave; jour afin d'examiner et d'appliquer ces mises &agrave; jour.</p>

<p>L'avertisseur se sert d'une liste des images d'installation, g&eacute;r&eacute;e dans vos param&egrave;tres personnels de l'outil de mise &agrave; jour, afin de d&eacute;terminer les images et les r&eacute;f&eacute;rentiels &agrave; surveiller pour la mise &agrave; jour de composants. La fr&eacute;quence &agrave; laquelle l'avertisseur v&eacute;rifie la pr&eacute;sence de mises &agrave; jour se base sur les pr&eacute;f&eacute;rences d&eacute;finies dans l'outil de mise &agrave; jour. Vous pouvez modifier le fait que l'avertisseur v&eacute;rifie ou non la pr&eacute;sence de mises &agrave; jour, et la fr&eacute;quence de v&eacute;rification, par le biais des pr&eacute;f&eacute;rence de l'outil de mise &agrave; jour : </p>

<p>Edition -&gt; Pr&eacute;ferences</p>

<p><b>Fonctionnement de l'avertisseur</b></p>
<p>Selon le syst&egrave;me d'exploitation et le type de bureau utilis&eacute;, il existe plusieurs m&eacute;thodes pour enregistrer l'avertisseur comme un programme d&eacute;marrant &agrave; la connexion du bureau&nbsp;:</p>
<ul><li>Windows&nbsp;: menu D&eacute;marrer -&gt; Tous les programmes -&gt; D&eacute;marrage</li>
<li>Gnome&nbsp;: Syst&egrave;me -&gt; Pr&eacute;f&eacute;rences -&gt; Sessions -&gt; Programmes de d&eacute;marrage  -&gt; Outil de mise &agrave; jour -&gt; Avertisseur du bureau</li>
<li>Mac OS X&nbsp;: Nom d'utilisateur/Library/LaunchAgents/com.sun.ucnotifier.plist</li></ul>

<p> Lorsque vous vous connectez &agrave; votre bureau, le programme de lancement de l'avertisseur commence par consulter la liste des images conserv&eacute;es dans les pr&eacute;f&eacute;rences de l'outil de mise &agrave; jour, afin de d&eacute;terminer l'image d'installation &agrave; partir de laquelle lancer la t&acirc;che de l'avertisseur. &Eacute;tant donn&eacute; que vous installez et d&eacute;sinstallez des images d'installation, le programme de lancement de l'avertisseur essaie toujours d'utiliser l'image d'installation la plus valide pour ex&eacute;cuter le programme de l'avertisseur.</p>

<p><b>Interface de l'avertisseur</b></p>
<p>Pour obtenir plus d'informations sur les options de menu offertes par l'avertisseur, consultez <a href="ui-desktop-notifier.html">Avertisseur du bureau</a> dans la section &quot;&Eacute;l&eacute;ments de l'interface&quot; de l'aide en ligne.</p>
</body>
</html>

