<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<!--

    DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

    Copyright (c) 2008-2010 Oracle and/or its affiliates. All rights reserved.

    The contents of this file are subject to the terms of either the GNU
    General Public License Version 2 only ("GPL") or the Common Development
    and Distribution License("CDDL") (collectively, the "License").  You
    may not use this file except in compliance with the License.  You can
    obtain a copy of the License at
    https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
    or packager/legal/LICENSE.txt.  See the License for the specific
    language governing permissions and limitations under the License.

    When distributing the software, include this License Header Notice in each
    file and include the License file at glassfish/bootstrap/legal/LICENSE.txt.

    GPL Classpath Exception:
    Oracle designates this particular file as subject to the "Classpath"
    exception as provided by Oracle in the GPL Version 2 section of the License
    file that accompanied this code.

    Modifications:
    If applicable, add the following below the License Header, with the fields
    enclosed by brackets [] replaced by your own identifying information:
    "Portions Copyright [year] [name of copyright owner]"

    Contributor(s):
    If you wish your version of this file to be governed by only the CDDL or
    only the GPL Version 2, indicate your decision by adding "[Contributor]
    elects to include this software in this distribution under the [CDDL or GPL
    Version 2] license."  If you don't indicate a single choice of license, a
    recipient has the option to distribute your version of this file under
    either the CDDL, the GPL Version 2 or to extend the choice of license to
    its licensees as provided above.  However, if you add GPL Version 2 code
    and therefore, elected the GPL Version 2 license, then the option applies
    only if the new code is made subject to such option by the copyright
    holder.

-->

<html>
<head>
<meta http-equiv="Content-type" content="text/html; charset=UTF-8">
<title>R&eacute;f&eacute;rentiels et &Eacute;diteurs - Aide en ligne de l'outil de mise &agrave; jour</title>
<meta name="robots" content="index,follow">
<meta name="robots" content="index,follow">
<meta name="date" content="">
</head>

<body>
<a name="repositories"></a><h4>R&eacute;f&eacute;rentiels et &Eacute;diteurs</h4>
<p>Une image d'installation est associ&eacute;e &agrave; un ou plusieurs r&eacute;f&eacute;rentiels de composants sur le r&eacute;seau. Chaque r&eacute;f&eacute;rentiel est repr&eacute;sent&eacute; par un &eacute;diteur et une URL associ&eacute;e. Le nom de l'&eacute;diteur est propre &agrave; chaque image d'installation et repr&eacute;sente l'organisation ou le projet qui g&egrave;re ce r&eacute;f&eacute;rentiel ainsi qu'une d&eacute;finition claire de son contenu. L'outil de mise &agrave; jour afficher l'&eacute;diteur dans la colonne &quot;Source&quot; des listes de composants affich&eacute;es.</p>

<p><b>Compatibilit&eacute; des logiciels de multiples r&eacute;f&eacute;rentiels</b></p>
<p>Lorsque vous cr&eacute;ez votre propre image d'installation ou modifiez la liste des r&eacute;f&eacute;rentiels associ&eacute;s &agrave; une image d'installation existante, veillez &agrave; ne d&eacute;signer que des r&eacute;f&eacute;rentiels contenant des composants compatibles avec votre logiciel existant.</p>

<p>Bien que vous ayez la possibilit&eacute; d'installer des add-on et des mises &agrave; jour provenant d'autres r&eacute;f&eacute;rentiels, ces add-ons ou mises &agrave; jour risquent de ne pas fonctionner correctement avec votre logiciel existant, m&ecirc;me si l'organisation ou projet g&eacute;rant ces r&eacute;f&eacute;rentiels a valid&eacute; ces combinaisons. </p>

<p><b>Contenu des r&eacute;f&eacute;rentiels</b></p>
<p>Chaque r&eacute;f&eacute;rentiel comprend un catalogue listant tous les composants qu'il contient. L'outil de mise &agrave; jour acc&egrave;de aux catalogues conserv&eacute;s au niveau local et &agrave; ceux situ&eacute;s sur le r&eacute;seau afin de lister les mises &agrave; jour et les add-on disponibles.</p>

<p>Chaque composant inclut un manifeste de son contenu. L'outil de mise &agrave; jour acc&egrave;de aux informations du manifeste afin de lister les fichiers install&eacute;s et les informations propres aux autres composants.</p>

<p><b>&Eacute;diteur pr&eacute;f&eacute;r&eacute;</b></p>
<p>L'un des r&eacute;f&eacute;rentiels de l'&eacute;diteur associ&eacute;s &agrave; une image d'installation doit &ecirc;tre identifi&eacute; comme l'&eacute;diteur pr&eacute;f&eacute;r&eacute;. Cette configuration permettra &agrave; l'outil de mise &agrave; jour, &agrave; l'outil de mise &agrave; jour de logiciel, &agrave; l'avertisseur du bureau et &agrave; l'interface de ligne de commande (CLI) de la commande pkg de savoir comment se comporter si plusieurs r&eacute;f&eacute;rentiels sont associ&eacute;s &agrave; la m&ecirc;me image d'installation.</p>

<p>Si un composant add-on existe sous un m&ecirc;me nom dans plusieurs r&eacute;f&eacute;rentiels d'&eacute;diteur et que l'un deux est marqu&eacute; comme &eacute;diteur pr&eacute;f&eacute;r&eacute;, l'outil de mise &agrave; jour et la CLI de la commande pkg afficheront et installeront le package nomm&eacute; depuis le r&eacute;f&eacute;rentiel de l'&eacute;diteur pr&eacute;f&eacute;r&eacute;.</p>

<p>Si vous utilisez la fonctionnalit&eacute; &quot;Afficher les versions r&eacute;centes&quot; de l'outil de mise &agrave; jour ou sp&eacute;cifiez le r&eacute;f&eacute;rentiel source lors de l'installation de l'add-on via la CLI de pkg, cet add-on sera install&eacute; &agrave; partir du r&eacute;f&eacute;rentiel source que vous avez sp&eacute;cifi&eacute;.</p>

<p>Si vous avez install&eacute; un composant &agrave; partir de l'&eacute;diteur pr&eacute;f&eacute;r&eacute;, l'outil de mise &agrave; jour, l'outil de mise &agrave; jour de logiciel et l'avertisseur du bureau ne rechercheront les mises &agrave; jour pour ce composant qu'&agrave; partir de l'&eacute;diteur pr&eacute;f&eacute;r&eacute;.</p>

<p>Si vous avez install&eacute; le package &agrave; partir d'un &eacute;diteur non pr&eacute;f&eacute;r&eacute;, l'outil de mise &agrave; jour, l'outil de mise &agrave; jour de logiciel et l'avertisseur du bureau n'afficheront que les mises &agrave; jour disponibles dans le r&eacute;f&eacute;rentiel d'installation d'origine du package.</p>

<p>Par d&eacute;faut, l'outil de mise &agrave; jour n'affiche que les versions les plus r&eacute;centes de chaque package. Vous pouvez utiliser la commande Afficher-&gt; Afficher les versions r&eacute;centes pour annuler ce comportement et afficher la liste de toutes les mises &agrave; jour disponibles dans tous les r&eacute;f&eacute;rentiels&nbsp;:</p>

<p><b>Modifier l'affichage des r&eacute;f&eacute;rentiels</b></p>
<p>Vous pouvez modifier la liste des r&eacute;f&eacute;rentiels associ&eacute;s &agrave; une image d'installation en s&eacute;lectionnant l'image d&eacute;sir&eacute;e et en ex&eacute;cutant l'une des op&eacute;rations suivantes :</p>

<ul><li>Cliquez avec la touche droite pour afficher le menu contextuel et s&eacute;lectionnez (Properties...) Propri&eacute;t&eacute;s... </li>
<li>Cliquez sur le bouton Edit Properties (Editer Propri&eacute;t&eacute;s) dans l'onglet Image Details (D&eacute;tails de l'image).</li>
<li>Cliquez sur Fichier -&gt; Image Properties (Propri&eacute;t&eacute;s d'image) dans le menu principal.</li></ul>

<p><b>Enregistrement en local des informations des r&eacute;f&eacute;rentiels</b></p>
<p>La liste des r&eacute;f&eacute;rentiels associ&eacute;s &agrave; une image d'installation, ainsi que les copies locales des catalogues et des manifestes de composants, sont situ&eacute;es dans le r&eacute;pertoire .org.opensolaris,pkg/ de chaque image d'installation.</p> 

</body>
</html>

