<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<!--

    DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

    Copyright (c) 2008-2010 Oracle and/or its affiliates. All rights reserved.

    The contents of this file are subject to the terms of either the GNU
    General Public License Version 2 only ("GPL") or the Common Development
    and Distribution License("CDDL") (collectively, the "License").  You
    may not use this file except in compliance with the License.  You can
    obtain a copy of the License at
    https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
    or packager/legal/LICENSE.txt.  See the License for the specific
    language governing permissions and limitations under the License.

    When distributing the software, include this License Header Notice in each
    file and include the License file at glassfish/bootstrap/legal/LICENSE.txt.

    GPL Classpath Exception:
    Oracle designates this particular file as subject to the "Classpath"
    exception as provided by Oracle in the GPL Version 2 section of the License
    file that accompanied this code.

    Modifications:
    If applicable, add the following below the License Header, with the fields
    enclosed by brackets [] replaced by your own identifying information:
    "Portions Copyright [year] [name of copyright owner]"

    Contributor(s):
    If you wish your version of this file to be governed by only the CDDL or
    only the GPL Version 2, indicate your decision by adding "[Contributor]
    elects to include this software in this distribution under the [CDDL or GPL
    Version 2] license."  If you don't indicate a single choice of license, a
    recipient has the option to distribute your version of this file under
    either the CDDL, the GPL Version 2 or to extend the choice of license to
    its licensees as provided above.  However, if you add GPL Version 2 code
    and therefore, elected the GPL Version 2 license, then the option applies
    only if the new code is made subject to such option by the copyright
    holder.

-->

<html>
<head>
<meta http-equiv="Content-type" content="text/html; charset=UTF-8">
<title>Informaci&oacute;n de documento - Ayuda en l&iacute;nea de Update Tool</title>
<meta name="robots" content="index,follow">
<meta name="robots" content="index,follow">
<meta name="date" content="">
</head>

<body>



<a name="documentinfo"></a><p>Parte n&ordm;.:820-5843</p><p></p><p>4150 Network Circle<br>Santa Clara, CA 95054<br>EE.UU.</p><p>Copyright 2008 Sun Microsystems, Inc.</p><p>Sun Microsystems, Inc. tiene los derechos de propiedad intelectual sobre la tecnolog&iacute;a incluida en el producto que se describe en este documento.  En particular, y sin limitaci&oacute;n alguna, estos derechos de propiedad intelectual pueden incluir una o varias patentes en los EE.UU. o aplicaciones de patentes pendientes en EE.UU. y otros pa&iacute;ses.</p><p> Derechos del Gobierno de los EE.UU. &ndash;  software comercial.  Los usuarios del Gobierno est&aacute;n sujetos al contrato de licencia est&aacute;ndar de Sun Microsystem, Inc. y a las disposiciones aplicables del FAR y sus suplementos.</p><p> Esta distribuci&oacute;n puede incluir materiales desarrollados por terceros.</p><p> Las piezas del producto pueden estar derivadas de sistemas Berkeley BSD, cuya utilizaci&oacute;n est&aacute; sujeta a la licencia de la Universidad de California. UNIX es una marca comercial registrada en los EE.UU. y otros pa&iacute;ses, bajo licencia exclusiva de X/Open Company, Ltd.  </p><p>Sun, Sun Microsystems, el logotipo de Sun, el logotipo de la taza de caf&eacute; de Java, docs.sun.com, Java y Solaris son marcas comerciales o marcas comerciales registradas de Sun Microsystems, Inc. en los EE.UU. y otros pa&iacute;ses.  Todas las marcas comerciales de SPARC se utilizan bajo licencia y son marcas comerciales o marcas comerciales registradas de SPARC International, Inc. en los EE.UU. y otros pa&iacute;ses.  Los productos relacionados con las marcas comerciales de SPARC est&aacute;n basados en una arquitectura desarrollada por Sun Microsystems, Inc.
</p><p>La interfaz gr&aacute;fica de usuario de OPEN LOOK y Sun<sup>TM</sup> fue desarrollada por Sun Microsystems, Inc. para sus usuarios y licenciatarios.  Sun reconoce los esfuerzos pioneros de Xerox en la investigaci&oacute;n y el desarrollo del concepto de interfaces visuales o gr&aacute;ficas de usuario para la industria de la inform&aacute;tica.  Sun posee una licencia no exclusiva de Xerox sobre la interfaz gr&aacute;fica de usuario de Xerox. Esta licencia tambi&eacute;n cubre a los licenciatarios de Sun que implementen la interfaz gr&aacute;fica de usuario de OPEN LOOK y cumplan con los contratos de licencia escritos de Sun.</p><p> Los productos e informaci&oacute;n contenidos en esta publicaci&oacute;n est&aacute;n controlados por las leyes de exportaci&oacute;n de los EE.UU. y podr&iacute;an estar sujetos a las leyes de exportaci&oacute;n o importaci&oacute;n en otros pa&iacute;ses. Queda totalmente prohibido el uso de este producto para aplicaciones como armas nucleares, qu&iacute;micas o biol&oacute;gicas, de un modo directo o indirecto. Queda totalmente prohibida la exportaci&oacute;n o reexportaci&oacute;n a pa&iacute;ses sujetos a embargo por parte de los EE.UU. o a entidades incluidas en las listas de exclusi&oacute;n de exportaci&oacute;n de los EE.UU, incluyendo, entre otros, a las personas objeto de la prohibici&oacute;n y, en especial, las listas de naturales designados.</p><p>ESTA DOCUMENTACI&Oacute;N SE PROPORCIONA &ldquo;TAL CUAL&rdquo; Y TODAS LAS GARANT&Iacute;AS, REPRESENTACIONES Y CONDICIONES IMPL&Iacute;CITAS O EXPRESAS, INCLUIDA CUALQUIER GARANT&Iacute;A IMPL&Iacute;CITA DE COMERCIABILIDAD, IDONEIDAD PARA UN PROP&Oacute;SITO PARTICULAR O DE NO VIOLACI&Oacute;N, EST&Aacute;N EXCLUIDAS DE RESPONSABILIDAD HASTA EL PUNTO EN EL QUE TALES EXENCIONES SEAN CONSIDERADAS NO V&Aacute;LIDAS LEGALMENTE.</p>




</body>
</html>

