<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<!--

    DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

    Copyright (c) 2008-2010 Oracle and/or its affiliates. All rights reserved.

    The contents of this file are subject to the terms of either the GNU
    General Public License Version 2 only ("GPL") or the Common Development
    and Distribution License("CDDL") (collectively, the "License").  You
    may not use this file except in compliance with the License.  You can
    obtain a copy of the License at
    https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
    or packager/legal/LICENSE.txt.  See the License for the specific
    language governing permissions and limitations under the License.

    When distributing the software, include this License Header Notice in each
    file and include the License file at glassfish/bootstrap/legal/LICENSE.txt.

    GPL Classpath Exception:
    Oracle designates this particular file as subject to the "Classpath"
    exception as provided by Oracle in the GPL Version 2 section of the License
    file that accompanied this code.

    Modifications:
    If applicable, add the following below the License Header, with the fields
    enclosed by brackets [] replaced by your own identifying information:
    "Portions Copyright [year] [name of copyright owner]"

    Contributor(s):
    If you wish your version of this file to be governed by only the CDDL or
    only the GPL Version 2, indicate your decision by adding "[Contributor]
    elects to include this software in this distribution under the [CDDL or GPL
    Version 2] license."  If you don't indicate a single choice of license, a
    recipient has the option to distribute your version of this file under
    either the CDDL, the GPL Version 2 or to extend the choice of license to
    its licensees as provided above.  However, if you add GPL Version 2 code
    and therefore, elected the GPL Version 2 license, then the option applies
    only if the new code is made subject to such option by the copyright
    holder.

-->

<html>
<head>
<meta http-equiv="Content-type" content="text/html; charset=UTF-8">
<title>Crear una imagen instalada nueva - Ayuda en l&iacute;nea de Update Tool</title>
<meta name="robots" content="index,follow">
<meta name="robots" content="index,follow">
<meta name="date" content="">
</head>

<body>



<a name="tasks-creating-image"></a><h4> Crear una imagen de instalaci&oacute;n nueva</h4>
<p>Si necesita crear una imagen de instalaci&oacute;n nueva y vac&iacute;a y asociarla a uno o varios dep&oacute;sitos de componentes, puede utilizar la funci&oacute;n Imagen nueva de la interfaz de Update Tool.  Una vez creada la imagen de instalaci&oacute;n vac&iacute;a, puede seleccionar componentes de complemento de los dep&oacute;sitos e instalarlos en la imagen nueva.</p>
<p>
    <ol><li><p>En la barra de herramientas, haga clic en Nueva.</p><p>Update Tool muestra la ventana Crear imagen de instalaci&oacute;n nueva. </p><p></p></li>
<li><p>En el cuadro T&iacute;tulo de la imagen, escriba un nombre para la imagen de instalaci&oacute;n. </p><p>Dado que este nombre va a aparecer en el panel Im&aacute;genes de aplicaci&oacute;n como el nombre de la imagen instalada, intente que el t&iacute;tulo sea relativamente corto.</p><p></p></li>
<li><p>En el cuadro Directorio de imagen, escriba la ruta completa del directorio que albergar&aacute; la imagen. </p><p>Otra posibilidad es hacer clic en el bot&oacute;n ... para navegar hacia el directorio (y, opcionalmente, crearlo).</p><p>&Eacute;sta es la ubicaci&oacute;n en la que se instalar&aacute;n todos los componentes de complemento. </p><p></p></li>
<li><p> En el cuadro Descripci&oacute;n de la imagen, escriba una descripci&oacute;n opcional para la imagen.</p></li>
<li><p> En el &aacute;rea Dep&oacute;sitos, utilice el bot&oacute;n Agregar... para agregar uno o varios dep&oacute;sitos a la imagen.</p><p>Por cada dep&oacute;sito que agregue debe especificar el nombre y la URL del editor del dep&oacute;sito.</p><p>El nombre del editor aparecer&aacute; en la columna &quot;Origen&quot; cuando consulte las listas de actualizaciones y componentes de complemento disponibles.</p><p></p></li>
<li><p>Haga clic en Aceptar.</p><p>Update Tool agrega la imagen a la lista del panel Im&aacute;genes de aplicaci&oacute;n, se pone en contacto con los dep&oacute;sitos, recopila la lista de componentes instalables y muestra la lista debajo de Complementos disponibles.</p></li></ol>
</p>

<p>Puede agregar varios dep&oacute;sitos del editor a la imagen de instalaci&oacute;n, pero uno de ellos debe estar marcado como el dep&oacute;sito preferido. Los complementos del editor preferido tendr&aacute;n prioridad sobre los complementos que, con el mismo nombre, procedan de otros editores asociados a la imagen de instalaci&oacute;n.</p>

<p>Consulte la secci&oacute;n <a href="repositories.html">Dep&oacute;sitos y editores</a> para obtener m&aacute;s informaci&oacute;n sobre el editor preferido y sus efectos en la instalaci&oacute;n y actualizaci&oacute;n de componentes.</p>

<p>Ya puede <a href="tasks-installing-add-ons.html">examinar e instalar componentes de complemento</a> asociados a la imagen nueva.</p>



</body>
</html>

