<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<!--

    DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

    Copyright (c) 2008-2010 Oracle and/or its affiliates. All rights reserved.

    The contents of this file are subject to the terms of either the GNU
    General Public License Version 2 only ("GPL") or the Common Development
    and Distribution License("CDDL") (collectively, the "License").  You
    may not use this file except in compliance with the License.  You can
    obtain a copy of the License at
    https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
    or packager/legal/LICENSE.txt.  See the License for the specific
    language governing permissions and limitations under the License.

    When distributing the software, include this License Header Notice in each
    file and include the License file at glassfish/bootstrap/legal/LICENSE.txt.

    GPL Classpath Exception:
    Oracle designates this particular file as subject to the "Classpath"
    exception as provided by Oracle in the GPL Version 2 section of the License
    file that accompanied this code.

    Modifications:
    If applicable, add the following below the License Header, with the fields
    enclosed by brackets [] replaced by your own identifying information:
    "Portions Copyright [year] [name of copyright owner]"

    Contributor(s):
    If you wish your version of this file to be governed by only the CDDL or
    only the GPL Version 2, indicate your decision by adding "[Contributor]
    elects to include this software in this distribution under the [CDDL or GPL
    Version 2] license."  If you don't indicate a single choice of license, a
    recipient has the option to distribute your version of this file under
    either the CDDL, the GPL Version 2 or to extend the choice of license to
    its licensees as provided above.  However, if you add GPL Version 2 code
    and therefore, elected the GPL Version 2 license, then the option applies
    only if the new code is made subject to such option by the copyright
    holder.

-->

<html>
<head>
<meta http-equiv="Content-type" content="text/html; charset=UTF-8">
<title>Desktop-Meldungsgenerator &ndash; Onlinehilfe zu Update Tool</title>
<meta name="robots" content="index,follow">
<meta name="robots" content="index,follow">
<meta name="date" content="">
</head>

<body>
<a name="notifier"></a><h4>Desktop-Meldungsgenerator</h4>
<p>Gemeinsam mit Update Tool pr&uuml;ft eine Hintergrund-Benachrichtigungsaufgabe (oder Meldungsgenerator), ob Updates verf&uuml;gbar sind und meldet Ihnen &uuml;ber den Desktop, ob Updates f&uuml;r alle Installationsabbilder verf&uuml;gbar sind, die in Ihrer Installation von Update Tool erfasst sind.</p>

<p><b>Registrieren des Meldungsgenerators</b></p>
<p>Wenn Sie w&auml;hrend der ersten Installation des Abbilds das automatische Pr&uuml;fen auf Updates und die Benachrichtigung &uuml;ber Updates aktivieren, wird der Meldungsgenerator in Ihrer Desktop-Umgebung automatisch als Startprogramm registriert.</p>

<p>Wenn ein urspr&uuml;ngliches Installationsprogramm den Meldungsgenerator nicht registriert, k&ouml;nnen Sie seine automatische Registrierung veranlassen, indem Sie Update Tool mindestens eine Minute lang ausf&uuml;hren. Wenn in den Update Tool-Einstellungen eine andere Pr&uuml;fh&auml;ufigkeit als &quot;Nie&quot; festgelegt ist, wird der Meldungsgenerator automatisch registriert.</p>

<p><b>Starten des Meldungsgenerators</b></p>
<p>Bei jeder Anmeldung beim Desktop wird der Meldungsgenerator gestartet und als Hintergrundprozess ausgef&uuml;hrt. Der Meldungsgenerator wird im Benachrichtigungsbereich Ihres Desktops nur angezeigt, wenn f&uuml;r mindestens eines Ihrer Installationsabbilder Updates verf&uuml;gbar sind. (Eine Ausnahme besteht unter Mac OS X. Hier wird der Meldungsgenerator niemals im Dock Ihres Desktops dargestellt.)</p>

<p><b>Benachrichtigung &uuml;ber Updates</b></p>
<p>Wenn der Meldungsgenerator verf&uuml;gbare Updates ermittelt, werden im Benachrichtigungsbereich Ihres Desktops ein Symbol und ein Fenster angezeigt, &uuml;ber das Sie das Software Update Tool starten k&ouml;nnen, um die verf&uuml;gbaren Updates zu pr&uuml;fen und zu &uuml;bernehmen.</p>

<p>Der Meldungsgenerator verwendet die Liste der in Ihren pers&ouml;nlichen Update Tool-Einstellungen verwalteten Installationsabbilder, um zu ermitteln, welche Abbilder und Repositories auf aktualisierte Komponenten &uuml;berwacht werden sollen. In welchen Abst&auml;nden der Meldungsgenerator nach Updates sucht, richtet sich nach den in Update Tool festgelegten Einstellungen. Sie k&ouml;nnen in den Einstellungen von Update Tool festlegen, ob der Meldungsgenerator auf das Vorhandensein von Updates pr&uuml;ft und wie h&auml;ufig diese Pr&uuml;fungen auf Updates stattfinden.</p>

<p>Bearbeiten -&gt; Einstellungen</p>

<p><b>Verwenden des Meldungsgenerators</b></p>
<p>Je nach verwendetem Betriebssystem und Desktop-Typ werden unterschiedliche Methoden zur Registrierung des Meldungsgenerators als Startprogramm bei der Desktop-Anmeldung verwendet:</p>
<ul><li>Windows: Startmen&uuml; -&gt; Programme -&gt; Autostart</li>
<li>Gnome: System -&gt; Einstellungen -&gt; Sitzungen -&gt; Startprogramme -&gt; Update Tool-Meldungsgenerator</li>
<li>Mac OS X: Benutzername/Library/LaunchAgents/com.sun.ucnotifier.plist</li></ul>

<p>Bei der Anmeldung beim Desktop &uuml;berpr&uuml;ft ein Meldungsgenerator-Startprogramm zun&auml;chst die Liste der Installationsabbilder, die im Einstellungsbereich von Update Tool verwaltet werden, um zu ermitteln, aus welchem Installationsabbild die Meldungsgenerator-Aufgabe gestartet werden soll. Bei der Installation und Deinstallation von Installationsabbildern versucht das Meldungsgenerator-Startprogramm, stets ein g&uuml;ltiges Installationsabbild f&uuml;r die Ausf&uuml;hrung des Meldungsgenerators zu verwenden.</p>

<p><b>Die Oberfl&auml;che des Meldungsgenerators</b></p>
<p>Weitere Informationen zu den Men&uuml;optionen des Meldungsgenerators finden Sie im Abschnitt &quot;Bestandteile der Benutzeroberfl&auml;che&quot; der Online-Hilfe im <a href="ui-desktop-notifier.html">Desktop-Meldungsgenerator</a>.</p>
</body>
</html>

