<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<!--

    DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

    Copyright (c) 2008-2010 Oracle and/or its affiliates. All rights reserved.

    The contents of this file are subject to the terms of either the GNU
    General Public License Version 2 only ("GPL") or the Common Development
    and Distribution License("CDDL") (collectively, the "License").  You
    may not use this file except in compliance with the License.  You can
    obtain a copy of the License at
    https://glassfish.dev.java.net/public/CDDL+GPL_1_1.html
    or packager/legal/LICENSE.txt.  See the License for the specific
    language governing permissions and limitations under the License.

    When distributing the software, include this License Header Notice in each
    file and include the License file at glassfish/bootstrap/legal/LICENSE.txt.

    GPL Classpath Exception:
    Oracle designates this particular file as subject to the "Classpath"
    exception as provided by Oracle in the GPL Version 2 section of the License
    file that accompanied this code.

    Modifications:
    If applicable, add the following below the License Header, with the fields
    enclosed by brackets [] replaced by your own identifying information:
    "Portions Copyright [year] [name of copyright owner]"

    Contributor(s):
    If you wish your version of this file to be governed by only the CDDL or
    only the GPL Version 2, indicate your decision by adding "[Contributor]
    elects to include this software in this distribution under the [CDDL or GPL
    Version 2] license."  If you don't indicate a single choice of license, a
    recipient has the option to distribute your version of this file under
    either the CDDL, the GPL Version 2 or to extend the choice of license to
    its licensees as provided above.  However, if you add GPL Version 2 code
    and therefore, elected the GPL Version 2 license, then the option applies
    only if the new code is made subject to such option by the copyright
    holder.

-->

<html>
<head>
<meta http-equiv="Content-type" content="text/html; charset=UTF-8">
<title>Repositorys und Publisher - Update Tool-Online-Hilfe</title>
<meta name="robots" content="index,follow">
<meta name="robots" content="index,follow">
<meta name="date" content="">
</head>

<body>
<a name="repositories"></a><h4>Repositorys und Publisher</h4>
<p>Installationsabbilder sind einem oder mehreren Netzwerk-Repositories mit Komponenten zugeordnet. Jedes Repository wird mit einem Publisher und einer verkn&uuml;pften URL dargestellt. Ein Publisher-Name ist in jedem Installationsabbild eindeutig und steht sowohl f&uuml;r das Unternehmen als auch f&uuml;r das Projekt, &uuml;ber das das Repository und ein genau definierter Bereich des Inhalts verwaltet werden. Das Update Tool zeigt den Publisher in der Spalte &quot;Quelle&quot; der Ansichten f&uuml;r die Komponentenauflistung an.</p>

<p><b>Kompatibilit&auml;t von Software aus mehreren Repositories</b></p>
<p>Wenn Sie ein eigenes Installationsabbild erstellen oder die Liste der Repositories &auml;ndern, die mit einem bestehenden Installationsabbild verkn&uuml;pft sind, m&uuml;ssen Sie darauf achten, nur auf die Repositories zu verweisen, deren Komponenten mit der bestehenden Software kompatibel sind.</p>

<p>Auch wenn Sie Add-Ons und Update aus anderen Repositories installieren k&ouml;nnen, funktionieren die neuen Add-Ons oder Updates unter Umst&auml;nden nicht einwandfrei mit der bestehenden Software, wenn das Unternehmen oder das Projekt, das die Repositories verwaltet, diese Kombinationen nicht validiert hat.</p>

<p><b>Inhalt der Repositories</b></p>
<p>Jedes Repository beinhaltet einen Katalog, in dem alle im Repository enthaltenen Komponenten aufgef&uuml;hrt sind. Update Tool greift sowohl auf lokal verwaltete als auch auf netzwerkbasierte Kataloge zu, um die verf&uuml;gbaren Updates und Add-Ons aufzulisten.</p>

<p>Jede Komponente beinhaltet ein Manifest des Komponenteninhalts. Update Tool greift auf die Manifestinformationen zu, um installierte Dateien und andere komponentenspezifische Informationen aufzulisten.</p>

<p><b>Bevorzugte Publisher</b></p>
<p>Eines der mit einem Installationsabbild verkn&uuml;pften Repositorys muss als &quot;bevorzugtes&quot; Repository gekennzeichnet werden. Mit dieser Einstellung k&ouml;nnen Update Tool, das Software Update Tool, der Desktop-Meldungsgenerator und die pkg-Befehlszeilenschnittstelle ermitteln, wie sie vorgehen m&uuml;ssen, wenn mit einem Installationsabbild mehrere Repositorys verkn&uuml;pft sind.</p>

<p>Wenn eine Add-On-Komponente dem Namen nach in mehreren Publisher-Repositorys vorliegt und einer der Publisher als bevorzugter Publisher gekennzeichnet ist, f&uuml;hren Update Tool und die pkg-Befehlszeilenschnittstelle das bezeichnete Paket auf und installieren es aus dem bevorzugten Publisher-Repository.</p>

<p>Wenn Sie die Funktion &quot;Alle Versionen anzeigen&quot; von Update Tool verwenden oder Sie beim Installieren des Add-Ons &uuml;ber die pkg-Befehlszeilenschnittstelle das Quell-Repository angeben, wird das Add-On &uuml;ber das angegebene Quell-Repository installiert.</p>

<p>Wenn eine Komponente &uuml;ber den bevorzugten Publisher installiert wurde, suchen Update Tool, Software Update und der Desktop-Meldungsgenerator nach Updates f&uuml;r diese Komponente, die nur vom bevorzugten Publisher stammen.</p>

<p>Wenn das Paket aus einem nicht bevorzugten Repository installiert wurde, f&uuml;hren Update Tool, Software Update und der Desktop-Meldungsgenerator nur die Updates auf, die im Repository verf&uuml;gbar sind, &uuml;ber das das Paket urspr&uuml;nglich installiert wurde.</p>

<p>Update Tool listet standardm&auml;&szlig;ig nur die neueste Version jedes Pakets auf. Mit dem Befehl Anzeigen -&gt; Alle Versionen anzeigen k&ouml;nnen Sie dieses Verhalten au&szlig;er Kraft setzen und alle verf&uuml;gbaren Updates aus allen Repositorys auflisten:</p>

<p><b>&Auml;ndern der Liste der Repositories</b></p>
<p>Sie k&ouml;nnen die Liste der Repositories, die mit einem Installationsabbild verkn&uuml;pft sind, bearbeiten, indem Sie das gew&uuml;nschte Abbild ausw&auml;hlen und einen der folgenden Vorg&auml;nge ausf&uuml;hren:</p>

<ul><li>Klicken Sie mit der rechten Maustaste, um das Kontextmen&uuml; anzuzeigen, und w&auml;hlen Sie Eigenschaften... aus.</li>
<li>Klicken Sie auf der Registerkarte Abbilddetails auf die Schaltfl&auml;che Abbilddetails. </li>
<li>W&auml;hlen Sie im Hauptmen&uuml; Datei -&gt; Abbildeigenschaften aus. </li></ul>

<p><b>Locale Speicherung der Repository-Informationen</b></p>
<p>Die Liste der einem Installationsabbild zugeordneten Repositories sowie lokale Kopien von Katalogen und Komponentenmanifesten befinden sich im Verzeichnis .org.opensolaris,pkg/ der einzelnen Installations-Abbilder.</p> 

</body>
</html>

